ab-w-plugin.output
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.25
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      100
Time taken for tests:   7.212 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      13623000 bytes
HTML transferred:       13287000 bytes
Requests per second:    138.66 [#/sec] (mean)
Time per request:       721.168 [ms] (mean)
Time per request:       7.212 [ms] (mean, across all concurrent requests)
Transfer rate:          1844.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.1      0      10
Processing:    20  717 1862.3     79    6565
Waiting:        8  714 1862.3     77    6563
Total:         20  717 1864.3     79    6572

Percentage of the requests served within a certain time (ms)
  50%     79
  66%     90
  75%     99
  80%    106
  90%   3319
  95%   6443
  98%   6467
  99%   6478
 100%   6572 (longest request)