ab-w-plugin.output
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.25
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      100
Time taken for tests:   0.340 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      501000 bytes
HTML transferred:       286000 bytes
Requests per second:    2943.16 [#/sec] (mean)
Time per request:       33.977 [ms] (mean)
Time per request:       0.340 [ms] (mean, across all concurrent requests)
Transfer rate:          1439.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      0      13
Processing:     3   31   7.3     29      54
Waiting:        1   31   7.3     29      54
Total:         13   32   6.8     30      54

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     35
  75%     38
  80%     39
  90%     41
  95%     43
  98%     46
  99%     49
 100%     54 (longest request)